# StairNotEnoughBoundaryCurvesError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..StairNotEnoughBoundaryCurvesError Property
BuiltInFailures..::..SketchFailures Class See Also
---
Stairs require boundaries (chains of one or more Boundary Lines) on each side of the Stair.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairNotEnoughBoundaryCurvesError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairNotEnoughBoundaryCurvesError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairNotEnoughBoundaryCurvesError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace